app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "歯磨きをする"], ["completed", nil], ["created_at", "2024-07-17 15:17:08.063036"], ["updated_at", "2024-07-17 15:17:08.063036"]]
---
    def create
        @todo = Todo.new(todo_params)
        if @todo.save

UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", 1], ["updated_at", "2024-07-17 15:19:01.904430"], ["id", 1]]
---
    def update
        if @todo.update(todo_params)